//=============================================================================
//
// 女.x処理 [Onna.h]
// Author : HAL東京 GP11B341-17 80277 染谷武志
//
//=============================================================================
#ifndef _ONNA_H_
#define _ONNA_H_

#include "main.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	ONNA_XFILE		"data/MODEL/onna.x"		// 読み込むモデル名
#define ONNA_NUM		(10)					// エネミーの数
#define ONNA_HP_MAX	(10)
#define ONNA_DIRECTION	(200.0f)
#define ONNA_SCALE		(3.0f)

//*****************************************************************************
// グローバル変数
//*****************************************************************************
// キャラクターのデータを管理する構造体
typedef struct {
	LPDIRECT3DTEXTURE9	D3DTexture;			// テクスチャへのポインタ
	LPD3DXMESH			D3DXMesh;			// メッシュ情報へのポインタ
	LPD3DXBUFFER		D3DXBuffMat;		// マテリアル情報へのポインタ
	DWORD				NumMat;				// マテリアル情報の数
	D3DXVECTOR3			pos;				// モデルの位置
	D3DXVECTOR3			move;				// モデルの移動量
	D3DXVECTOR3			rot;				// 現在の向き
	D3DXVECTOR3			scl;				// モデルの大きさ(スケール)
	int					HP;					// 体力
	int					HPzan;				// 残り体力
}ONNA;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitOnna(int type);
void UninitOnna(void);
void UpdateOnna(void);
void DrawOnna(void);

#endif
